RIET/src/Tasks/RentalCostsApproval/RentalCostsApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>RentalCostsApproval</name>
  <basedOn>Document.RentalTrucksCostsSums</basedOn>
  <addressing>InformationRegister.TripsNonLawsonApprovalManagers</addressing>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>RentalCost</name>
    <type>
      <types>DocumentRef.RentalTrucksCostsSums</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>InformationForApproval</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.StatusesOfApproval</types>
    </type>
  </attributes>
  <attributes>
    <name>ReasonOfRejection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreviouslyApprovedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>PreviouslyApproved</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>ApprovalManager</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevels</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RIET/src/Enums/ApprovalLevels/ApprovalLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalLevels</name>
  <enumValues>
    <name>Level1</name>
  </enumValues>
  <enumValues>
    <name>Level2</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/StatusesOfApproval/StatusesOfApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StatusesOfApproval</name>
  <enumValues>
    <name>SentForApproval</name>
  </enumValues>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>Rejected</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Tasks/RentalCostsApproval/Forms/ФормаЗадачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПредварительноеУтверждение.Видимость = (Объект.ApprovalLevel=Перечисления.ApprovalLevels.Level2);
	Sum = 0;
	Если ЗначениеЗаполнено(Объект.RentalCost) Тогда
		ДатаДока = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.RentalCost, "Дата");
		Для Каждого Строка ИЗ Объект.RentalCost.RentalTrucks Цикл
			Sum = Sum + LocalDistributionForNonLawsonСервер.ПолучитьCostsSumSLBUSD(Строка.Cost, Строка.Currency, ДатаДока);
		КонецЦикла;
	КонецЕсли;
	CostSum = Sum;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура SendForApproval(Команда)
	
	Если ЗначениеЗаполнено(Объект.Status) 
		И (Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.SentForApproval") 
		ИЛИ Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Rejected")) Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'. 
			|Нет необходимости отправлять на утверждение.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'. 
			|No need to send for approval.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаSendForApproval", ЭтаФорма);
	
	ТекстВопроса = "Send for approval and close form / Отправить на утверждение и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Send for approval / Отправить на утверждение");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаSendForApproval(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	SendForApprovalНаСервере();
	
	Оповестить("ЗаписанApproval", , Объект.RentalCost);
	ОповеститьОбИзменении(Объект.RentalCost);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура SendForApprovalНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Объект.Status = Перечисления.StatusesOfApproval.Rejected Тогда 
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Объект.ПометкаУдаления = Ложь;
	Записать();
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

////////////////////////////////

&НаКлиенте
Процедура CancelApproval(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Закрыть();
	КонецЕсли;
	
	Если Объект.ПометкаУдаления И ЗначениеЗаполнено(Объект.Status) 
		И Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Canceled") Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаCancelApproval", ЭтаФорма);
	
	ТекстВопроса = "Cancel approval and close form / Отменить утверждение и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Cancel approval / Отменить утверждение");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаCancelApproval(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	CancelApprovalНаСервере();
	
	Оповестить("ЗаписанApproval", , Объект.RentalCost);
	ОповеститьОбИзменении(Объект.RentalCost);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура CancelApprovalНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Объект.ПометкаУдаления = Истина;
	Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

//////////////////////////////////////////////

&НаКлиенте
Процедура Approve(Команда)
	
	Если ЗначениеЗаполнено(Объект.Status) 
		И (Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Canceled") 
		ИЛИ Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Approved")) Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаApprove", ЭтаФорма);
	
	ТекстВопроса = "Approve trip and close form / Утвердить условия поставки и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Approve / Утвердить");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаApprove(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ApproveНаСервере();
	
	Оповестить("ЗаписанApproval", , Объект.RentalCost);
	ОповеститьОбИзменении(Объект.RentalCost);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ApproveНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Объект.Status = Перечисления.StatusesOfApproval.Rejected Тогда 
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Объект.Status = Перечисления.StatusesOfApproval.Approved;
	
	ПараметрыЗаписи = Новый Структура("ВыполнитьЗадачу", Истина);
	Записать(ПараметрыЗаписи);
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

//////////////////////////////////////////////

&НаКлиенте
Процедура Reject(Команда)
	
	Если ЗначениеЗаполнено(Объект.Status) 
		И (Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Canceled") 
		ИЛИ Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Rejected")) Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаReject", ЭтаФорма);
	
	ТекстВопроса = "Reject and close form/ Отклонить и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Reject / Отклонить");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаReject(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	RejectНаСервере();	
	
	Оповестить("ЗаписанApproval", , Объект.RentalCost);
	ОповеститьОбИзменении(Объект.RentalCost);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура RejectНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Объект.Status = Перечисления.StatusesOfApproval.Approved Тогда 
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Объект.Status = Перечисления.StatusesOfApproval.Rejected;
	
	ПараметрыЗаписи = Новый Структура("ВыполнитьЗадачу", Истина);
	Записать(ПараметрыЗаписи);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ГруппаПредварительноеУтверждение.Видимость = (Объект.ApprovalLevel=Перечисления.ApprovalLevels.Level2);
	
КонецПроцедуры
